# Intro
__Note:__ For simplicity, we are imitating a SQL environment here by using:
- PandaSQL package
- local CSV file

In [2]:
import string
import pandas as pd
from pandasql import sqldf
from random import choice, random

In [18]:
major_choices = ['Math', 'Physics', 'Computer Science', 'English', 'History', 'Biology', 'Chemistry', 'Socioligy', 'Art']
year_choices = [1, 2, 3, 4, 4]

major_gpa_avgs = {major: random() + 2.5 for major in major_choices}

n = 100_000
names = [''.join([choice(string.ascii_letters) for _ in range(7)]) for _ in range(n)]
majors = [choice(major_choices) for _ in range(n)]
gpas = [min(major_gpa_avgs[major] + random() / 4.0, 4.0) for major in majors]
years = [choice(year_choices) for _ in range(n)]

student_data = pd.DataFrame(data = zip(names, gpas, majors, years), columns = ['Name', 'GPA', 'Major', 'Year'])
student_data.head()

      Name       GPA      Major  Year
0  SHygSic  3.023112    English     3
1  xKDYZQQ  2.587882  Socioligy     4
2  ncTOrjQ  3.125083    Physics     4
3  mUceOKK  3.136578    Biology     2
4  EQYZLXe  3.182723       Math     1

# SELECT

In [19]:
# SELECT all data
statement = "SELECT * FROM student_data LIMIT 10;"
selected_data = sqldf(statement, globals())  # globals() allows the sqldf function access global variables one of which is the student_data dataframe
print(selected_data)

      Name       GPA      Major  Year
0  SHygSic  3.023112    English     3
1  xKDYZQQ  2.587882  Socioligy     4
2  ncTOrjQ  3.125083    Physics     4
3  mUceOKK  3.136578    Biology     2
4  EQYZLXe  3.182723       Math     1
5  zbpbYZs  3.233008    Biology     3
6  gSVhhFK  3.061708        Art     3
7  uIGeYNU  3.179604       Math     3
8  UctShmA  3.177383    English     4
9  fZghLSu  3.188530       Math     4

In [20]:
# SELECT specific columns
statement = "SELECT Name, GPA FROM student_data LIMIT 10;"
selected_data = sqldf(statement, globals())
print(selected_data)

      Name       GPA
0  SHygSic  3.023112
1  xKDYZQQ  2.587882
2  ncTOrjQ  3.125083
3  mUceOKK  3.136578
4  EQYZLXe  3.182723
5  zbpbYZs  3.233008
6  gSVhhFK  3.061708
7  uIGeYNU  3.179604
8  UctShmA  3.177383
9  fZghLSu  3.188530

# DISTINCT

In [21]:
# SELECT only DISTINCT values
statement = "SELECT DISTINCT Major FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

              Major
0           English
1         Socioligy
2           Physics
3           Biology
4              Math
5               Art
6  Computer Science
7           History
8         Chemistry

# COUNT

In [22]:
# COUNT DISTINCT Majors
statement = "SELECT COUNT(DISTINCT Major) FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

   COUNT(DISTINCT Major)
0                      9

# AS
Give a name to a column in the output

In [24]:
statement = "SELECT COUNT(DISTINCT Major) AS NumMajors FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

   NumMajors
0          9

In [25]:
statement = "SELECT COUNT(DISTINCT Major) AS 'Number of Majors' FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

   Number of Majors
0                 9

In [27]:
# SELECT only DISTINCT combinations of two columns
statement = "SELECT DISTINCT Major, Year FROM student_data;"
selected_data = sqldf(statement, globals())
print(selected_data)

               Major  Year
0            English     3
1          Socioligy     4
2            Physics     4
3            Biology     2
4               Math     1
5            Biology     3
6                Art     3
7               Math     3
8            English     4
9               Math     4
10  Computer Science     4
11           Biology     4
12           English     2
13           History     2
14               Art     1
15  Computer Science     3
16         Chemistry     4
17  Computer Science     1
18         Chemistry     1
19         Chemistry     2
20           Biology     1
21              Math     2
22               Art     2
23         Socioligy     2
24           History     4
25           History     1
26           Physics     2
27  Computer Science     2
28         Socioligy     3
29           Physics     1
30         Socioligy     1
31               Art     4
32         Chemistry     3
33           History     3
34           English     1
35           Physics     3